---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.PrimitiveType
source: html/f0b47a17-85be-d631-10c1-76358114f7dc.htm
---
# Autodesk.Revit.DB.DirectContext3D.PrimitiveType

Type of geometry primitive represented as a number.

## Syntax (C#)
```csharp
public enum PrimitiveType
```